---
kind: property
id: P:Autodesk.Revit.DB.ExtrusionRoof.CurtainGrids
source: html/39baec89-9d0d-ba88-6485-ac8b76ccb6d0.htm
---
# Autodesk.Revit.DB.ExtrusionRoof.CurtainGrids Property

Retrieve all the CurtainGrid objects of a curtain Roof.

## Syntax (C#)
```csharp
public CurtainGridSet CurtainGrids { get; }
```

## Remarks
Only when the object is a CurtainRoof, this property makes sense.